[
  {
    "title": "SLACA - Student Lifestyle and Academic Convenience Aid (Mobile App)",
    "content": "As a team of 5, we developed SLACA, a smart and student-centric platform that integrates academic resources, community interaction, and an AI-powered assistant to enhance university life. The project was awarded High Distinction (HD) as a capstone submission.",
    "logo": "SLACA",
    "liveUrl": "https://youtu.be/BfHOfMSaIE0/",
    "description": [
      "Designed and built a modular full-stack application using FastAPI for backend services and React-based frontend modules for seamless student interaction",
      "Implemented LLM-powered chatbot enhanced with Retrieval-Augmented Generation (RAG) to deliver contextual, evolving responses based on user-generated content",
      "Developed key modules including Circle (community posts), Study (course/program explorer), Media (event updates), Vendor (student deals), and Me (profile and contribution tracking)",
      "Integrated gamification through point-based participation rewards, enhancing student engagement within communities",
      "Collaborated within a 5-person interdisciplinary team and received supervision from Prof. Lei Wang, achieving High Distinction for innovation and impact"
    ],
    "techStack": ["FastAPI", "React", "PostgreSQL", "Python", "TypeScript"]
  },
  {
    "title": "IT Tech - Antenna, Security & IT Support Website",
    "content": "A real-world paid project developed independently for a digital agency. Delivered a modern full-stack Next.js website for an IT support company, featuring services such as antenna installation, security systems, and technical support. Implemented automated email systems, CMS-powered blogging, and advanced SEO optimization.",
    "logo": "ITTechWebsite",
    "liveUrl": "https://antenna-1gcp.vercel.app/",
    "gitHubUrl": "https://github.com/PatrickYuzhiji/antenna",
    "description": [
      "Built a mobile-first, responsive user interface using Next.js 15 and Tailwind CSS 4.0, with reusable TypeScript-based components and accessible, branded design",
      "Integrated Resend for dual automated email workflows, sending structured admin notifications and customer confirmations with custom React email templates",
      "Implemented Sanity CMS for headless blog management with rich content editing, author management, image optimization, and live content preview",
      "Optimized for SEO with structured data, dynamic sitemaps, robots.txt, Open Graph metadata, and local business schema targeting Wollongong area",
      "Deployed on Vercel with Turbopack for fast builds, supporting real-time updates on GitHub push with zero downtime"
    ],
    "techStack": [
      "NextJS",
      "TypeScript",
      "TailwindCSS",
      "SanityCMS",
      "Resend",
      "Vercel"
    ]
  },
  {
    "title": "Soil Swell Potential Prediction(Cross-platform Mobile App)",
    "content": "Designed and developed a cross-platform mobile application to predict the swelling potential of expansive soils, accelerating initial decision-making by reducing reliance on time-consuming lab tests.",
    "liveUrl": "https://youtube.com/shorts/z3A3B9INcyg?feature=share",
    "logo": "SwellApp",
    "description": [
      "Built an intuitive user interface using React Native and Expo, incorporating AsyncStorage, FileSystem, and Sharing for efficient data storage and management",
      "Integrated and deployed optimized machine learning models (ONNX) using onnxruntime-react-native, enabling real-time, offline predictions directly on mobile devices",
      "Awarded a $6,000 scholarship through the UOW EIS Summer Scholarship Program in recognition of contributions to this innovative project",
      "Note: Due to the proprietary nature of the project, the codebase is not publicly available"
    ],
    "techStack": ["ReactNative", "Expo", "ONNX"]
  },
  {
    "title": "BadgerChat(Frontend)",
    "content": "Developed BadgerChat, a React-based chat application enabling real-time communication in various chatrooms, utilizing React Router for dynamic navigation and React Bootstrap for a responsive UI.",
    "logo": "BadgerChat",
    "gitHubUrl": "https://github.com/PatrickYuzhiji/BadgerChat",
    "description": [
      "Implemented user authentication with registration, login, logout, and session persistence using context API and sessionStorage, ensuring seamless user experiences",
      "Built message posting, pagination, and deletion features with fetch API, enforcing role-based access control and efficient state management using React Hooks (useState, useEffect, useContext)",
      "Ensured form validation and accessibility by integrating regular expressions, semantic HTML, and labeled form controls, improving security and user experience"
    ],
    "techStack": ["React", "Bootstrap", "Vite"]
  },
  {
    "title": "EasyParking Management Portal(Full-stack web application)",
    "content": "Developed a full-stack web application for parking lot operators to manage parking spaces, allowing users to register, log in, check in/out parking spots, and automatically calculate fees.",
    "logo": "EasyParking",
    "description": [
      "Implemented administrator features enabling managers to add/remove parking lots and spaces, insert/edit parking locations, search parking spots, and view user data",
      "Created backend services as RESTful APIs using Python, FastAPI, and Postman, and designed a user-friendly interface using HTML5, CSS, JavaScript, and jQuery",
      "Utilized Docker to containerize MySQL, leveraging SQLAlchemy's ORM capabilities for data operations such as create, read, update, and delete"
    ],
    "techStack": [
      "HTML",
      "CSS",
      "JavaScript",
      "Python",
      "FastAPI",
      "MySQL",
      "SQLAlchemy",
      "Docker",
      "jQuery",
      "Postman"
    ]
  },
  {
    "title": "Giphy Search App(React-based Single-Page Application)",
    "content": "Built a single-page web app to search and browse GIFs using the Giphy API, displaying trending GIFs by default.",
    "logo": "GiphySearch",
    "gitHubUrl": "https://github.com/PatrickYuzhiji/GiphySearchApp",
    "description": [
      "Implemented pagination, search, loading indicators, and copy-to-clipboard functionality for each GIF",
      "Employed React Context API for state management (search term, pagination, loading states)",
      "Styled the UI with React Bootstrap and custom CSS, ensuring a clean, modern interface",
      "Configured a serverless workflow for deployment via AWS (S3 + CloudFront) and maintained build scripts for production readiness"
    ],
    "techStack": ["React", "Bootstrap", "AWS", "Serverless", "Axios"]
  }
]
