[
  {
    "title": "IT Tech - Antenna, Security & IT Support Website",
    "content": "A real-world paid project developed independently for a digital agency. Delivered a modern full-stack Next.js website for an IT support company, featuring services such as antenna installation, security systems, and technical support. Implemented automated email systems, CMS-powered blogging, and advanced SEO optimization.",
    "logo": "ITTechWebsite",
    "liveUrl": "https://antenna-1gcp.vercel.app/",
    "gitHubUrl": "https://github.com/PatrickYuzhiji/antenna",
    "description": [
      "Built a mobile-first, responsive user interface using Next.js 15 and Tailwind CSS 4.0, with reusable TypeScript-based components and accessible, branded design",
      "Integrated Resend for dual automated email workflows, sending structured admin notifications and customer confirmations with custom React email templates",
      "Implemented Sanity CMS for headless blog management with rich content editing, author management, image optimization, and live content preview",
      "Optimized for SEO with structured data, dynamic sitemaps, robots.txt, Open Graph metadata, and local business schema targeting Wollongong area",
      "Deployed on Vercel with serverless architecture ensuring zero server maintenance, supporting real-time updates on GitHub push with zero downtime"
    ],
    "techStack": [
      "NextJS",
      "TypeScript",
      "TailwindCSS",
      "SanityCMS",
      "Resend",
      "Vercel"
    ]
  },
  {
    "title": "EasyEV Charging Station Management System",
    "content": "A dynamic web-based application designed to manage electric vehicle charging stations across multiple locations. Built with PHP and MySQL, it supports real-time station availability, cost tracking, and session history for users, while providing administrators with full control over station and user management.",
    "logo": "EasyEV",
    "liveUrl": "https://easyev.infinityfreeapp.com/",
    "gitHubUrl": "https://github.com/PatrickYuzhiji/EasyEV-Charging-Project",
    "description": [
      "Developed role-based system with separate interfaces and capabilities for administrators and users, enhancing usability and data control",
      "Implemented real-time location availability tracking and session-based cost calculation using PHP and MySQL with foreign key constraints",
      "Created responsive frontend using HTML, CSS, and JavaScript, including location management dashboard, user registration, and charging session views",
      "Enabled auto-generation of database schema and sample data on first run, simplifying deployment across environments",
      "Deployed application on InfinityFree free hosting platform with manual database setup and PHP environment configuration"
    ],
    "techStack": ["PHP", "MySQL", "HTML", "CSS", "JavaScript"]
  },
  {
    "title": "BadgerChat(Frontend)",
    "content": "Developed BadgerChat, a React-based chat application enabling real-time communication in various chatrooms, utilizing React Router for dynamic navigation and React Bootstrap for a responsive UI.",
    "logo": "BadgerChat",
    "gitHubUrl": "https://github.com/PatrickYuzhiji/BadgerChat",
    "description": [
      "Implemented user authentication with registration, login, logout, and session persistence using context API and sessionStorage, ensuring seamless user experiences",
      "Built message posting, pagination, and deletion features with fetch API, enforcing role-based access control and efficient state management using React Hooks (useState, useEffect, useContext)",
      "Ensured form validation and accessibility by integrating regular expressions, semantic HTML, and labeled form controls, improving security and user experience"
    ],
    "techStack": ["React", "Bootstrap", "Vite"]
  },
  {
    "title": "EasyParking Management Portal(Full-stack web application)",
    "content": "Developed a full-stack web application for parking lot operators to manage parking spaces, allowing users to register, log in, check in/out parking spots, and automatically calculate fees.",
    "logo": "EasyParking",
    "description": [
      "Implemented administrator features enabling managers to add/remove parking lots and spaces, insert/edit parking locations, search parking spots, and view user data",
      "Created backend services as RESTful APIs using Python, FastAPI, and Postman, and designed a user-friendly interface using HTML5, CSS, JavaScript, and jQuery",
      "Utilized Docker to containerize MySQL, leveraging SQLAlchemy's ORM capabilities for data operations such as create, read, update, and delete"
    ],
    "techStack": [
      "HTML",
      "CSS",
      "JavaScript",
      "Python",
      "FastAPI",
      "MySQL",
      "SQLAlchemy",
      "Docker",
      "jQuery",
      "Postman"
    ]
  },
  {
    "title": "Giphy Search App(React-based Single-Page Application)",
    "content": "Built a single-page web app to search and browse GIFs using the Giphy API, displaying trending GIFs by default.",
    "logo": "GiphySearch",
    "gitHubUrl": "https://github.com/PatrickYuzhiji/GiphySearchApp",
    "description": [
      "Implemented pagination, search, loading indicators, and copy-to-clipboard functionality for each GIF",
      "Employed React Context API for state management (search term, pagination, loading states)",
      "Styled the UI with React Bootstrap and custom CSS, ensuring a clean, modern interface",
      "Configured a serverless workflow for deployment via AWS (S3 + CloudFront) and maintained build scripts for production readiness"
    ],
    "techStack": ["React", "Bootstrap", "AWS", "Serverless", "Axios"]
  }
]
